/*
bfc
块级格式化上下文
规定了内部的格子如何定位
有如下几个规定：
1、内部的盒子会按照垂直方向一个接一个放置
2、box垂直方向的距离由margin决定，属于同一个bfc的两个相邻box的margin会重叠
3、bfc是页面上一个 独立的空间，容器里面的子元素不会影响容器外面
4、计算BFC的高度时，浮动元素也会参与计算。

满足以下条件之一可触发BFC
1、根元素，即html
2、float属性不为none
3、display属性为inline-block/table/table-cell
4、overflow属性不为visible
5、position值为absolute或fixed;
*/

/*
解决 margin塌陷:
包裹一层子元素，并设置定位（即创建一个新的BFC）
*/

/*
box-sizing的值
1、默认为 contet-box ：标准盒模型：宽度 = 内容的宽度(content) + border + padding + margin
    设置的width为content的值
2、border-box:  ie低版本模型：宽度 = 内容的宽度(content + border + padding) + margin
    设置的width为content+border+padding的值 
*/

// 垂直水平居中方式
/*
1、脱离文档流的居中：
    1）绝对定位 + margin: auto；
    2）负margin法，子元素需要固定宽高
    3）绝对定位 position:absolute;  top:50%;left:50%;transform:traslate(-50%,-50%);
2、未脱离文档流的居中：
    1）table text-align:center; vertical-align: middle;
    2）flex布局
 */


/*------------------------------------------------------------------------------------
    link和@import的区别：
------------------------------------------------------------------------------------*/
/*
1.从属关系区别
@import是 CSS 提供的语法规则，只有导入样式表的作用；link是HTML提供的标签，不仅可以加载 CSS 文件，还可以定义 RSS、rel 连接属性等。
2.加载顺序区别
加载页面时，link标签引入的 CSS 被同时加载；@import引入的 CSS 将在页面加载完毕后被加载。
3.兼容性区别
@import是 CSS2.1 才有的语法，故只可在 IE5+ 才能识别；link标签作为 HTML 元素，不存在兼容性问题。
4.DOM可控性区别
可以通过 JS 操作 DOM ，插入link标签来改变样式；由于 DOM 方法是基于文档的，无法使用@import的方式插入样式。
5.权重区别(该项有争议，下文将详解)
link引入的样式权重大于@import引入的样式。
*/
/*------------------------------------------------------------------------------------
    css两行或三行显示省略号
------------------------------------------------------------------------------------*/
/*------------------------------------------------------------------------------------
    三栏布局
    实现三栏布局，左右固定，中间自适应
------------------------------------------------------------------------------------*/
/*------------------------------------------------------------------------------------
    响应式布局：媒体查询、rem、flex
------------------------------------------------------------------------------------*/

/*------------------------------------------------------------------------------------
    浮动float的值有哪些
------------------------------------------------------------------------------------*/

/*------------------------------------------------------------------------------------
    Css实现左右两列的瀑布流
------------------------------------------------------------------------------------*/
